{
  "main": {
    "name":"Joshua Chua",
    "occupation":"Software Engineer",
    "description":"Currently a third year student at the University of Toronto, I am looking for ways to develop impactful software and incite meaningful change.",
    "image":"profilepic.jpg",
    "bio":"Hey there! I made this website for you to get to know me better, so feel free to browse my work experiences and projects. If you would like discuss about anything you see on this page, my contact details are listed below - I'd love to connect!",
    "contactmessage": "Want to get in contact with me? Shoot me a message below!",
    "email": "joshuagodwin.chua@mail.utoronto.ca",
    "phone": "647-687-1389", 
    "address":{
      "street":"",
      "city":"Toronto",
      "state":"Ontario",
      "zip": ""
    },
    "website": "http://www.joshuachua.me",
    "resumedownload":"https://drive.google.com/file/d/1-B4a1ZVPdHtg2huNaydAlcix6F9vvbYJ/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/joshua.chua22/",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/joshua-c/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/thejoshuachua",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/jchua24",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"As someone who enjoys working on projects with others, I recognize the importance of having both technical ability and interpersonal skills. Below is a summary of a few key skills that make me suitable to contribute on any team: ",
    "education":[
      {
        "school":"University of Toronto",
        "degree":"Bachelor of Science, Computer Science",
        "graduated":"September 2018 - Present",
        "description":" Through my first few years, I have taken courses such as: Data Structures and Analysis, Algorithm Design, Software Engineering, Operating Systems, Theory of Computation, and Data Science. Some of my favourite memories from undergrad so far have come from group projects, where I've gotten the chance to build new and interesting web apps, mobile apps, and design prototypes!", 
        "extracurriculars": "In addition to my academics, I have taken various leadership roles on campus and enjoy the opportunities to collaborate with others. Whether it be as a UofT Department of Computer Science Ambassador or UofTHacks Logistic Executive, working with others in the student community is always a rewarding experience! I also enjoy connecting with others in the form of mentorship, and have gotten a chance to do so as an E-Mentor for incoming Woodsworth College students."
      }
    ],
    "work":[
      {
        "company":"BMO Financial Group",
        "title":"Software Engineer Intern",
        "years":"September 2020 - Present",
        "description":"At my current position with BMO, I recently started working on a project to migrate an on-premise system to AWS! Before that, I worked predominantly with automation, and developed a suite of end-to-end solutions to track BMO server vulnerabilities and login metrics more efficiently."
      },
      {
        "company":"Teranet",
        "title":"Software Engineer Intern",
        "years":"May 2020 - August 2020",
        "description":"Throughout my internship term at Teranet,  I was able to take on a greater leadership role and was given larger development tasks. For example, I led the end-to-end development of the Registration Tracking feature in Geowarehouse using AngularJS and Java Spring, providing 10+ real estate boards and commercial clients with data on recent property transactions. On the frontend side, I worked on improving the e-store by implementing dynamic product retrieval. Lastly, I performed a platform-wide data refresh using SQL and data analysis techniques, providing 85,000+ Geowarehouse users with accurate neighbourhood demographics data on all properties in Ontario."
      },
      {
        "company":"Medsoft Group",
        "title":"Mobile Software Developer",
        "years":"April 2020 - Present",
        "description":"At my time with Medsoft group, I spearheaded the exciting development of Dose, a mobile app designed to help patients better keep track of their prescription medications. Leveraging the cross-platform functionality of Nativescript, I created an intuitive UI and integrated the app with Azure RESTful APIs for user authentication, data retrieval and persistence. Overall, it was a really interesting experience to see how products are bootstrapped from the ground up, with the hopes that one day this could be presented to doctors and those in the medical industry!"
      }, 
      { 
        "company":"University of Toronto - Daniels Faculty of Architecture ",
        "title":"Software Developer (Research Assistant)",
        "years":"April 2020 - Present",
        "description":"In collaboration with the MIT Urban Risk Lab and the Daniels Faculty of Architecture at UofT, I contributed to the development of Flux.Land - a geospatial platform that is being used to assess risk factors and data trends throughout Broward County, Floward. One of my key contributions was redesigning the graduate research showcase page and integrating it with Mapbox tilesets that I created using Mapbox’s Javascript framework. Additionally, I reduced the amount of time required to load the platform by implementing Express.js endpoints to more efficiently serve assets. It was a great experience to develop software and work with faculty in the university!"
      }, 
      {
        "company":"Teranet",
        "title":"Software Engineer Intern",
        "years":"May 2019 - August 2019",
        "description": "In my first software engineering internship, I got the opportunity to participate in an agile scrum development where I did full-stack development using a wide range of technologies such as AngularJS, Java Spring, SQL, Maven, Docker, and Jenkins. Throughout the term, I developed two new Automated Valuation Model reports that are now available to purchase in the Geowarehouse e-store for 85,000+ users! Additionally, I worked on optimizing the UI of client-facing property pages and expanded the data output of various web services."
      }
    ],
    "skills":[
      {
        "name":"Backend Development (Node.js, Java Spring, Flask)",
        "level":"80%"
      },
      {
        "name":"Frontend Development (React, AngularJS, HTML/CSS)",
        "level":"80%"
      },
      {
        "name":"Databases - (MySQL, MongoDB, DynamoDB)",
        "level":"75%"
      },
      {
        "name":"AWS Cloud Development",
        "level":"65%"
      },
      {
        "name":"Communication",
        "level":"95%"
      },
      {
        "name":"Leadership",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title": "Appetite", 
        "category": "Tinder-style mobile app that helps people decide where to eat.", 
        "image": "appetite.png", 
        "url": "https://play.google.com/store/apps/details?id=com.parkjs.appetite&hl=en_CA&gl=US"

      },
      {
        "title":"B2Z - Boomer2Zoomer",
        "category":"A platform to connect the younger generations with great mentors!",
        "image":"b2z.png",
        "url":"https://youtu.be/xArKLByn1p4"
      },
      {
        "title":"Dose",
        "category":"An app to help patients correctly log their medication usage.",
        "image":"dose.png",
        "url":"https://github.com/jchua24/dose"
      },
      {
        "title":"Fluxland",
        "category":"Innovative geo-spatial platform to address the risk factors of Broward County.",
        "image":"fluxland.png",
        "url":"https://broward.flux.land"
      }, 
      {
        "title":"Geowarehouse",
        "category": "Used by real estate boards across Ontario. This is what I've worked on during my internships!",
        "image":"teranet.jpeg",
        "url":"https://www2.geowarehouse.ca/"
      },
      {
        "title":"ATM Machine",
        "category":"Need more cash? This Java program has you covered.",
        "image":"atm.jpg",
        "url":"https://github.com/jchua24/ATM-Machine"
      },
      {
        "title":"Autocompleter Engine",
        "category":"Because what else would data structures and python be used for?",
        "image":"autocompleter.png",
        "url":"https://github.com/jchua24/AutocompleterEngine"
      },
      {
        "title":"Announcements App",
        "category":"A mobile solution to a school's unsatisfactory PA system.",
        "image":"announcements.png",
        "url":"https://play.google.com/store/apps/details?id=ca.tssappclub.tssannouncements&hl=en_CA"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Joshua is a professional and reliable developer. He handles his assignments promptly, and delivers them with efficiency. He is an amazing team member, and can be trusted to work independently as well. He has proven to be extremely resourceful and innovative with technical issues, and it’s clear that he is well versed in various front end development frameworks. Joshua maintains high standards for his work and can be observed to be striving for excellence in each of his endeavours. Joshua will be a great asset for any team he joins.",
        "user":"Isaac Seah, Flux.Land"
      }, 
      {
        "text":"Joshua has been working as a co-op developer in my team, and I really enjoyed working with him. He was a fast learner and demonstrated strong responsibilities with his tasks.  Everyone in the team liked working with Joshua and he earned trust from his team members in a short time.",
        "user":"Sean Yun, Teranet"
      }
    ]
  }
}
